{
	"inputs": [

			{
				"type": "file",

				"attributes": [{
					"attr": "accept",
					"value": "png"
				}],
				"title": "File / accept",
				"explanation": "If the value of the type attribute is file, then this attribute will indicate the types of files that the server accepts, otherwise it will be ignored. The value must be a comma-separated list of unique content type specifiers.",
				"list": [{
						"item": "A file extension starting with the STOP character (U+002E). (e.g. .jpg, .png, .doc)."
					},
					{
						"item": "A valid MIME type with no extensions."
					},
					{
						"item": "audio/* representing sound files. HTML5."
					},
					{
						"item": "video/* representing video files. HTML5."
					},
					{
						"item": "image/* representing image files. HTML5."
					}
				]


			},
			{
				"type": "text",
				"attributes": [{
					"attr": "autocomplete",
					"value": "off"
				}],
				"title": "Text / autocomplete",
				"explanation": "This attribute indicates whether the value of the control can be automatically completed by the browser. Possible values are:",
				"list": [{
						"item": "off: The user must explicitly enter a value into this field for every use, or the document provides its own auto-completion method. The browser does not automatically complete the entry."
					}, {
						"item": "on: The browser is allowed to automatically complete the value based on values that the user has entered during previous uses, however on does not provide any further information about what kind of data the user might be expected to enter."
					}, {
						"item": "name: Full name."
					}, {
						"item": "honorific-prefix: Prefix or title (e.g. Mr., Ms., Dr., Mlle)."
					}, {
						"item": "given-name: First name."
					}, {
						"item": "additional-name: Middle name."
					}, {
						"item": "family-name: Last name."
					}, {
						"item": "honorific-suffix: Suffix (e.g. Jr., B.Sc., MBASW, II)."
					}, {
						"item": "nickname"
					},
					{
						"item": "email"
					}, {
						"item": "username"
					},
					{
						"item": "new-password: A new password (e.g. when creating an account or changing a password)."
					}, {
						"item": "current-password"
					}, {
						"item": "organization-title: Job title (e.g. Software Engineer, Senior Vice President, Deputy Managing Director)."
					}, {
						"item": "organization"
					}, {
						"item": "street-address"
					}, {
						"item": "address-line1, address-line2, address-line3, address-level4, address-level3, address-level2, address-level1"
					}, {
						"item": "country"
					}, {
						"item": "country-name"
					}, {
						"item": "postal-code"
					}, {
						"item": "cc-name: Full name as given on the payment instrument."
					}, {
						"item": "cc-given-name"
					}, {
						"item": "cc-additional-name"
					}, {
						"item": "cc-family-name"
					}, {
						"item": "cc-number: Code identifying the payment instrument (e.g. the credit card number)."
					}, {
						"item": "cc-exp: Expiration date of the payment instrument."
					}, {
						"item": "cc-exp-month"
					}, {
						"item": "cc-exp-year"
					}, {
						"item": "cc-csc: Security code for the payment instrument."
					}, {
						"item": "cc-type: Type of payment instrument (e.g. Visa)."
					}, {
						"item": "transaction-currency"
					}, {
						"item": "transaction-amount"
					}, {
						"item": "language: Preferred language; a valid BCP 47 language tag."
					}, {
						"item": "bday: birthday"
					}, {
						"item": "bday-day"
					},
					{
						"item": "bday-month"
					}, {
						"item": "bday-year"
					}, {
						"item": "sex: Gender identity (e.g. Female, Fa'afafine), free-form text, no newlines."
					}, {
						"item": "tel: full telephone number, including country code"
					}, {
						"item": "additional tel variants: tel-country-code, tel-national, tel-area-code, tel-local, tel-local-prefix, tel-local-suffix, tel-extension"
					}, {
						"item": "url: Home page or other Web page corresponding to the company, person, address, or contact information in the other fields associated with this field."
					},
					{
						"item": "photo: Photograph, icon, or other image corresponding to the company, person, address, or contact information in the other fields associated with this field."
					}, {
						"item": "See the WHATWG Standard for more detailed information. If the autocomplete attribute is not specified on an input element then the browser uses the autocomplete attribute value of the <input> element's form owner. The form owner is either the form element that this <input> element is a descendant of or the form element whose id is specified by the form attribute of the input element. For more information, see the autocomplete attribute in <form>. The autocomplete attribute also controls whether Firefox will, unlike other browsers, persist the dynamic disabled state and (if applicable) dynamic checkedness of an <input> across page loads. The persistence feature is enabled by default. Setting the value of the autocomplete attribute to off disables this feature. This works even when the autocomplete attribute would normally not apply to the <input> by virtue of its type. See bug 654072. For most modern browsers (including Firefox 38+, Google Chrome 34+, IE 11+), setting the autocomplete attribute will not prevent a browser's password manager from asking the user if they want to store login (username and password) fields and, if they agree, from autofilling the login the next time the user visits the page. See the autocomplete attribute and login fields."
					}
        ]
      },
			{
				"type": "text",
				"attributes": [{
					"attr": "autofocus",
					"value": "true"
				}],
				"title": "Text / autofocus",
				"explanation": "This Boolean attribute lets you specify that a form control should have input focus when the page loads, unless the user overrides it (e.g. by typing in a different control). Only one form element in a document can have the autofocus attribute, which is a Boolean. It cannot be applied if the type attribute is set to hidden (that is, you cannot automatically set focus to a hidden control). Note that the focusing of the control may occur before the firing of the DOMContentLoaded event."
			},
			{
				"type": "file",
				"attributes": [{
					"attr": "capture",
					"value": "true"
				}],
				"title": "File / capture",
				"explanation": "When the value of the type attribute is file, the presence of this Boolean attribute indicates that capture of media directly from the device's environment using a media capture mechanism is preferred."
			},
			{
				"type": "radio",
				"attributes": [{
					"attr": "checked",
					"value": "checked"
				}],
				"title": "radio / checked",
				"explanation": "When the value of the type attribute is radio or checkbox, the presence of this Boolean attribute indicates that the control is selected by default, otherwise it is ignored.Unlike other browsers, Firefox will by default persist the dynamic checked state of an <input> across page loads. Use the autocomplete attribute to control this feature."
			},
      {
				"type": "text",
				"attributes": [{
					"attr": "disabled",
					"value": "disabled"
				}],
				"title": "text / disabled",
				"explanation": "This Boolean attribute indicates that the form control is not available for interaction. In particular, the click event will not be dispatched on disabled controls. Also, a disabled control's value isn't submitted with the form. Unlike other browsers, Firefox will by default persist the dynamic disabled state of an <input> across page loads. Use the autocomplete attribute to control this feature."
			},
      {
				"type": "text",
				"attributes": [{
					"attr": "form",
					"value": "form-id"
				}],
				"title": "text / form",
				"explanation": "The form element that the input element is associated with (its form owner). The value of the attribute must be an id of a <form> element in the same document. If this attribute is not specified, this <input> element must be a descendant of a <form> element. This attribute enables you to place <input> elements anywhere within a document, not just as descendants of their form elements. An input can only be associated with one form."
			},
      {
				"type": "submit",
				"attributes": [{
					"attr": "formaction",
					"value": "formaction"
				}],
				"title": "submit / formaction",
				"explanation": "The URI of a program that processes the information submitted by the input element, if it is a submit button or image. If specified, it overrides the action attribute of the element's form owner."
			},
      {
				"type": "submit",
				"attributes": [{
					"attr": "formenctype",
					"value": "text/plain"
				}],
				"title": "submit / formenctype",
				"explanation": "If the input element is a submit button or image, this attribute specifies the type of content that is used to submit the form to the server. Possible values are: ( application/x-www-form-urlencoded: The default value if the attribute is not specified. Multipart/form-data: Use this value if you are using an <input> element with the type attribute set to file. Text/plain. )If this attribute is specified, it overrides the enctype attribute of the element's form owner."
			}

		]
	}
